bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  BLEScan* scan = BLEDevice::getScan();
  scan->setActiveScan(true);
  scan->setInterval(100);
  scan->setWindow(99);
  
  const int scanSeconds = 5;
  Serial.printf("Scanning for BLE devices for %d seconds...\n", scanSeconds);
  
  BLEScanResults results = scan->start(scanSeconds, false);
  int deviceCount = results.getCount();
  
  if (deviceCount < 0) {
    Serial.println("BLE scan failed");
    BLEDevice::deinit();
    return;
  }
  
  Serial.println("========================================");
  Serial.printf("BLE Scan Complete: %d device(s) found\n", deviceCount);
  Serial.println("========================================");
  
  for (int i = 0; i < deviceCount; i++) {
    // make a copy of the advertised device (don't bind to a reference to an internal/temporary object)
    BLEAdvertisedDevice device = results.getDevice(i);
    
    std::string rawName = device.getName();
    String devName = rawName.length() ? String(rawName.c_str()) : String("(unnamed)");
    String devAddr = String(device.getAddress().toString().c_str());
    int rssi = device.getRSSI();
    
    Serial.printf("[%d] Name: %s\n", i + 1, devName.c_str());
    Serial.printf("    Address: %s\n", devAddr.c_str());
    Serial.printf("    RSSI: %d dBm\n", rssi);
    
    if (device.haveServiceUUID()) {
      BLEUUID serviceUUID = device.getServiceUUID();
      Serial.printf("    Service UUID: %s\n", serviceUUID.toString().c_str());
    }
    
    if (device.haveManufacturerData()) {
      Serial.println("    Manufacturer data: present");
    }
    
    Serial.println("----------------------------------------");
  }
  
  // Clean up scan results before deinitializing BLE
  scan->clearResults();
  
  // Deinitialize BLE so WiFi can be used (ESP32-S3 cannot run both simultaneously)
  BLEDevice::deinit();
  
  Serial.println("========================================");
  Serial.println("BLE scan complete, BLE deinitialized for WiFi usage");
  Serial.println("NOTE: BLE will be re-initialized on-demand when sending MeshCore notifications");
  Serial.println("========================================");
}

bool ensureAuthenticated(AsyncWebServerRequest* request) {
  if (strlen(WEB_AUTH_USERNAME) == 0 || strlen(WEB_AUTH_PASSWORD) == 0) {
    return true;
  }

  if (request->authenticate(WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD)) {
    return true;
  }

  request->requestAuthentication();
  return false;
}

void initFileSystem() {
  // First attempt: try to mount without formatting
  if (LittleFS.begin(false)) {
    Serial.println("LittleFS mounted successfully");
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

  // If mount fails, explicitly format the filesystem first
  // This handles severely corrupted filesystems better than begin(true)
  if (!LittleFS.format()) {
    Serial.println("LittleFS format failed! Check partition table and flash configuration.");
    return;
  }

  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
}

bool connectToMeshCore() {
  lastMeshConnectAttempt = millis();
  meshDeviceConnected = false;
  meshTxCharacteristic = nullptr;
  meshRxCharacteristic = nullptr;
  meshChannelReady = false;
  meshProtocolState = MESH_STATE_DISCONNECTED;
  meshRxBufferPos = 0;

  Serial.printf("Scanning for MeshCore peer named '%s' (extended debug)...\n", BLE_PEER_NAME);

  BLEScan* scan = BLEDevice::getScan();
  scan->setActiveScan(true);
  // Tighten scan timing to improve chances of catching short MeshCore adverts
  scan->setInterval(200);
  scan->setWindow(160);

  const int scanSeconds = 10;
  BLEScanResults results = scan->start(scanSeconds, false);

  Serial.printf("Scan complete: %d devices found\n", results.getCount());

  for (int i = 0; i < results.getCount(); i++) {
    BLEAdvertisedDevice device = results.getDevice(i);

    // Debug: print what we saw for each advertiser
    std::string rawName = device.getName();
    String devName = rawName.length() ? String(rawName.c_str()) : String("");
    String devAddr = String(device.getAddress().toString().c_str());
    int rssi = device.getRSSI();
    Serial.printf("  [%d] Name='%s' Addr=%s RSSI=%d\n", i, devName.c_str(), devAddr.c_str(), rssi);

    // Print any advertised single service UUID (if present)
    bool svcPrinted = false;
    if (device.haveServiceUUID()) {
      BLEUUID adv = device.getServiceUUID();
      Serial.printf("       Advertised service UUID: %s\n", adv.toString().c_str());
      svcPrinted = true;
    }
    if (!svcPrinted) {
      Serial.println("       No single advertised service UUID available");
    }

    // Matching logic: exact name, substring, or advertised Nordic UART service UUID match
    bool nameMatches = (devName.length() && devName == String(BLE_PEER_NAME));
    bool nameContains = (devName.length() && devName.indexOf(String(BLE_PEER_NAME)) >= 0);
    bool serviceMatches = false;

    if (device.haveServiceUUID()) {
      BLEUUID adv = device.getServiceUUID();
      // Compare to Nordic UART Service UUID
      serviceMatches = adv.equals(BLEUUID(NUS_SERVICE_UUID));
    }

    if (!(nameMatches || nameContains || serviceMatches)) {
      Serial.println("       Not the MeshCore peer (name/service mismatch), skipping.");
      continue;
    }

    Serial.println("MeshCore peer candidate found, attempting connection...");

    // Clean up any existing client before creating a new one to avoid "Deregister Failed" errors
    if (meshClient != nullptr) {
      if (meshClient->isConnected()) {
        meshClient->disconnect();
      }
      delete meshClient;
      meshClient = nullptr;
      delay(BLE_CLIENT_CLEANUP_DELAY_MS);
    }

    meshClient = BLEDevice::createClient();
    meshClient->setClientCallbacks(&meshClientCallbacks);

    // Copy the address so we don't rely on the temporary BLEAdvertisedDevice
    BLEAddress peerAddress = device.getAddress();

    // Determine address type from the advertised device
    // MeshCore devices typically use random addresses
    esp_ble_addr_type_t addrType = device.getAddressType();
    
    if (!meshClient->connect(peerAddress, addrType)) {
      lastMeshError = "Connection attempt failed";
      Serial.println("Connection attempt failed");
      continue;
    }

    // Allow MTU negotiation and security handshake to complete before accessing services
    delay(BLE_MTU_NEGOTIATION_DELAY_MS);

    // Retry service discovery to handle cases where MTU negotiation may still be completing
    // Try Nordic UART Service (NUS) - used by MeshCore BLE companion firmware
    BLERemoteService* service = nullptr;
    std::map<std::string, BLERemoteService*>* discoveredServices = nullptr;
    for (int retry = 0; retry < BLE_SERVICE_DISCOVERY_RETRIES; retry++) {
      service = meshClient->getService(NUS_SERVICE_UUID);
      if (service != nullptr) {
        Serial.printf("Found MeshCore service on attempt %d\n", retry + 1);
        break;
      }
      
