bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      // If direct lookup fails, try full service discovery and look for our service
      discoveredServices = meshClient->getServices();
      if (discoveredServices != nullptr && !discoveredServices->empty()) {
        Serial.printf("Service discovery attempt %d: found %d service(s):\n", retry + 1, discoveredServices->size());
        for (auto& svc : *discoveredServices) {
          Serial.printf("  - Service UUID: %s\n", svc.first.c_str());
          // Check if this matches our target service UUID
          if (BLEUUID(svc.first).equals(BLEUUID(MESHCORE_SERVICE_UUID))) {
            service = svc.second;
            Serial.println("  ^ Found matching MeshCore service!");
            break;
          }
        }
        if (service != nullptr) {
          break;
        }
      } else {
        Serial.printf("Service discovery attempt %d: no services found yet\n", retry + 1);
      }
      
      if (retry < BLE_SERVICE_DISCOVERY_RETRIES - 1) {
        Serial.printf("Retrying service discovery in %d ms...\n", BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS);
        delay(BLE_SERVICE_DISCOVERY_RETRY_DELAY_MS);
      }
    }
    if (service == nullptr) {
      lastMeshError = "Nordic UART Service not found on peer";
      Serial.println("Nordic UART Service not found on peer, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    // Get TX characteristic (ESP32 writes to this)
    BLERemoteCharacteristic* txChar = service->getCharacteristic(NUS_TX_CHAR_UUID);
    if (txChar == nullptr) {
      lastMeshError = "NUS TX characteristic missing";
      Serial.println("NUS TX characteristic missing, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    if (!txChar->canWrite()) {
      lastMeshError = "NUS TX characteristic is not writable";
      Serial.println("NUS TX characteristic is not writable, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    // Get RX characteristic (ESP32 receives notifications from this)
    BLERemoteCharacteristic* rxChar = service->getCharacteristic(NUS_RX_CHAR_UUID);
    if (rxChar == nullptr) {
      lastMeshError = "NUS RX characteristic missing";
      Serial.println("NUS RX characteristic missing, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    if (!rxChar->canNotify()) {
      lastMeshError = "NUS RX characteristic cannot notify";
      Serial.println("NUS RX characteristic cannot notify, disconnecting...");
      meshClient->disconnect();
      continue;
    }

    // Register for notifications
    rxChar->registerForNotify(meshNotifyCallback);
    
    meshTxCharacteristic = txChar;
    meshRxCharacteristic = rxChar;
    meshDeviceConnected = true;
    meshProtocolState = MESH_STATE_CONNECTED;
    lastMeshError = "";
    Serial.println("Connected to MeshCore peer via Nordic UART Service");

    // Perform MeshCore protocol handshake
    if (!ensureMeshChannel()) {
      Serial.println("ensureMeshChannel() failed, disconnecting...");
      meshClient->disconnect();
      meshDeviceConnected = false;
      meshProtocolState = MESH_STATE_DISCONNECTED;
      return false;
    }

    return true;
  }

  // Free scan results so the BLE stack can reuse memory on the next attempt
  scan->clearResults();

  lastMeshError = "MeshCore peer not found during scan";
  Serial.println(lastMeshError.c_str());
  return false;
}
void disconnectFromMeshCore() {
  // Clean up the BLE client properly before deinit
  if (meshClient != nullptr) {
    if (meshClient->isConnected()) {
      Serial.println("Disconnecting from MeshCore...");
      meshClient->disconnect();
    }
    // Delete the client to properly deregister it from BLE stack
    delete meshClient;
    meshClient = nullptr;
  }
  
  meshDeviceConnected = false;
  meshTxCharacteristic = nullptr;
  meshRxCharacteristic = nullptr;
  meshChannelReady = false;
  meshProtocolState = MESH_STATE_DISCONNECTED;
  meshRxBufferPos = 0;
  
  // Only deinitialize BLE if it was initialized
  if (bleInitialized) {
    delay(BLE_DEINIT_CLEANUP_DELAY_MS);
    BLEDevice::deinit();
    bleInitialized = false;
    Serial.println("BLE deinitialized");
  }
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

bool ensureMeshChannel() {
  if (meshChannelReady && meshProtocolState == MESH_STATE_READY) {
    return true;
  }

  if (!meshDeviceConnected || meshTxCharacteristic == nullptr) {
    return false;
  }

  // Step 1: Send CMD_DEVICE_QUERY to negotiate protocol version
  if (meshProtocolState < MESH_STATE_NEGOTIATED) {
    Serial.println("Sending CMD_DEVICE_QUERY...");
    uint8_t queryCmd[2] = { CMD_DEVICE_QUERY, meshProtocolVersion };
    if (!sendMeshFrame(queryCmd, sizeof(queryCmd))) {
      lastMeshError = "Failed to send CMD_DEVICE_QUERY";
      return false;
    }
    
    if (!waitForMeshResponse(5000)) {
      lastMeshError = "Timeout waiting for RESP_CODE_DEVICE_INFO";
      return false;
    }
    
    if (meshLastResponseCode != RESP_CODE_DEVICE_INFO) {
      lastMeshError = "Unexpected response to CMD_DEVICE_QUERY";
      Serial.printf("Expected RESP_CODE_DEVICE_INFO (0x%02X), got 0x%02X\n", RESP_CODE_DEVICE_INFO, meshLastResponseCode);
      return false;
    }
    
    meshProtocolState = MESH_STATE_NEGOTIATED;
    Serial.println("Protocol negotiated successfully");
  }

  // Step 2: Send CMD_APP_START to start the application session
  if (meshProtocolState < MESH_STATE_READY) {
    Serial.println("Sending CMD_APP_START...");
    // CMD_APP_START payload: version (1), reserved (6), app_name (variable)
    const char* appName = "ESP32-Uptime";
    size_t appNameLen = strlen(appName);
    size_t cmdLen = 1 + 1 + APP_START_RESERVED_SIZE + appNameLen;
    uint8_t* startCmd = new uint8_t[cmdLen];
    startCmd[0] = CMD_APP_START;
    startCmd[1] = meshProtocolVersion;  // version
    memset(startCmd + 2, 0, APP_START_RESERVED_SIZE);  // reserved bytes
    memcpy(startCmd + 2 + APP_START_RESERVED_SIZE, appName, appNameLen);
    
    bool sent = sendMeshFrame(startCmd, cmdLen);
    delete[] startCmd;
    
    if (!sent) {
      lastMeshError = "Failed to send CMD_APP_START";
      return false;
    }
    
    if (!waitForMeshResponse(5000)) {
      lastMeshError = "Timeout waiting for RESP_CODE_SELF_INFO";
      return false;
    }
    
    if (meshLastResponseCode != RESP_CODE_SELF_INFO) {
      lastMeshError = "Unexpected response to CMD_APP_START";
      Serial.printf("Expected RESP_CODE_SELF_INFO (0x%02X), got 0x%02X\n", RESP_CODE_SELF_INFO, meshLastResponseCode);
      return false;
    }
    
    meshProtocolState = MESH_STATE_READY;
    Serial.println("Application session started successfully");
  }

  // Step 3: Provision the channel if needed
  if (!provisionMeshChannel()) {
    lastMeshError = "Mesh channel provisioning failed";
    return false;
  }

  meshChannelReady = true;
  return true;
}

bool provisionMeshChannel() {
  if (strlen(BLE_MESH_CHANNEL_NAME) == 0) {
    lastMeshError = "Mesh channel name missing";
    return false;
  }

  Serial.printf("Checking/provisioning MeshCore channel '%s'...\n", BLE_MESH_CHANNEL_NAME);
  
