bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // First try to get the channel at index 0 to see if it exists
  uint8_t getChannelCmd[2] = { CMD_GET_CHANNEL, meshChannelIndex };
  if (!sendMeshFrame(getChannelCmd, sizeof(getChannelCmd))) {
    lastMeshError = "Failed to send CMD_GET_CHANNEL";
    return false;
  }
  
  if (!waitForMeshResponse(3000)) {
    Serial.println("No response to CMD_GET_CHANNEL, will try to set channel");
  } else if (meshLastResponseCode == RESP_CODE_CHANNEL_INFO) {
    // Channel exists, we can use it
    Serial.println("Channel already exists, ready to use");
    return true;
  }
  
  // Channel doesn't exist or error, try to create/set it
  // CMD_SET_CHANNEL payload: channel_index (1), name (32 bytes null-padded), key (16 bytes)
  Serial.printf("Setting channel at index %d...\n", meshChannelIndex);
  
  uint8_t setChannelCmd[1 + 1 + MESH_CHANNEL_NAME_SIZE + MESH_CHANNEL_KEY_SIZE];
  memset(setChannelCmd, 0, sizeof(setChannelCmd));
  setChannelCmd[0] = CMD_SET_CHANNEL;
  setChannelCmd[1] = meshChannelIndex;
  
  // Copy channel name (up to MESH_CHANNEL_NAME_SIZE bytes, null-padded)
  size_t nameLen = strlen(BLE_MESH_CHANNEL_NAME);
  if (nameLen > MESH_CHANNEL_NAME_SIZE) nameLen = MESH_CHANNEL_NAME_SIZE;
  memcpy(setChannelCmd + 2, BLE_MESH_CHANNEL_NAME, nameLen);
  
  // Copy channel key (up to MESH_CHANNEL_KEY_SIZE bytes, null-padded)
  size_t keyLen = strlen(BLE_MESH_CHANNEL_KEY);
  if (keyLen > MESH_CHANNEL_KEY_SIZE) keyLen = MESH_CHANNEL_KEY_SIZE;
  memcpy(setChannelCmd + 2 + MESH_CHANNEL_NAME_SIZE, BLE_MESH_CHANNEL_KEY, keyLen);
  
  if (!sendMeshFrame(setChannelCmd, sizeof(setChannelCmd))) {
    lastMeshError = "Failed to send CMD_SET_CHANNEL";
    return false;
  }
  
  if (!waitForMeshResponse(3000)) {
    lastMeshError = "Timeout waiting for channel set response";
    return false;
  }
  
  if (meshLastResponseCode == RESP_CODE_OK) {
    Serial.println("Channel set successfully");
    lastMeshError = "";
    return true;
  } else if (meshLastResponseCode == RESP_CODE_ERR) {
    lastMeshError = "Failed to set channel (device error)";
    return false;
  }
  
  // Any other response - assume it worked
  Serial.printf("Received response code 0x%02X, assuming success\n", meshLastResponseCode);
  lastMeshError = "";
  return true;
}

void initWebServer() {

  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    if (!ensureAuthenticated(request)) {
      return;
    }
    request->send(200, "text/html", getWebPage());
  });

  server.on("/api/mesh/status", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    doc["connected"] = meshDeviceConnected;
    doc["peerName"] = BLE_PEER_NAME;
    doc["deviceName"] = BLE_DEVICE_NAME;
    doc["channel"] = BLE_MESH_CHANNEL_NAME;
    doc["channelReady"] = meshChannelReady;
    doc["protocolState"] = (int)meshProtocolState;
    doc["lastError"] = lastMeshError;
    doc["bleOperationInProgress"] = bleOperationInProgress;
    doc["monitoringPaused"] = monitoringPaused;

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  server.on("/api/mesh/send", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }

      // Check if a BLE operation is already in progress
      if (bleOperationInProgress) {
        request->send(503, "application/json", "{\"error\":\"BLE operation already in progress\"}");
        return;
      }

      JsonDocument doc;
      if (deserializeJson(doc, data, len) != DeserializationError::Ok) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      String title = doc["title"] | "Mesh Message";
      String message = doc["message"] | "";
      if (message.length() == 0) {
        request->send(400, "application/json", "{\"error\":\"Missing message\"}");
        return;
      }

      // Note: sendMeshCoreNotification handles WiFi/BLE switching internally
      // The response is sent before the operation completes because the async
      // web server would timeout during the WiFi/BLE switch.
      // The actual sending happens synchronously after the response.
      request->send(202, "application/json", "{\"success\":true,\"status\":\"queued\"}");
      
      // Send the notification (this blocks while doing WiFi/BLE switch)
      sendMeshCoreNotification(title, message);
    }
  );

  // get services
  server.on("/api/services", HTTP_GET, [](AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray array = doc["services"].to<JsonArray>();

    unsigned long currentTime = millis();

    for (int i = 0; i < serviceCount; i++) {
      if (services[i].lastCheck > 0) {
        services[i].secondsSinceLastCheck = (currentTime - services[i].lastCheck) / 1000;
      } else {
        services[i].secondsSinceLastCheck = -1; // Never checked
      }

      JsonObject obj = array.add<JsonObject>();
      obj["id"] = services[i].id;
      obj["name"] = services[i].name;
      obj["type"] = getServiceTypeString(services[i].type);
      obj["host"] = services[i].host;
      obj["port"] = services[i].port;
      obj["path"] = services[i].path;
      obj["expectedResponse"] = services[i].expectedResponse;
      obj["checkInterval"] = services[i].checkInterval;
      obj["passThreshold"] = services[i].passThreshold;
      obj["failThreshold"] = services[i].failThreshold;
      obj["consecutivePasses"] = services[i].consecutivePasses;
      obj["consecutiveFails"] = services[i].consecutiveFails;
      obj["isUp"] = services[i].isUp;
      obj["secondsSinceLastCheck"] = services[i].secondsSinceLastCheck;
      obj["lastError"] = services[i].lastError;
    }

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
  });

  // add service
  server.on("/api/services", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL,
    [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
      if (!ensureAuthenticated(request)) {
        return;
      }
      if (serviceCount >= MAX_SERVICES) {
        request->send(400, "application/json", "{\"error\":\"Maximum services reached\"}");
        return;
      }

      JsonDocument doc;
      DeserializationError error = deserializeJson(doc, data, len);

      if (error) {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
      }

      Service newService;
      newService.id = generateServiceId();
      newService.name = doc["name"].as<String>();

      String typeStr = doc["type"].as<String>();
      if (typeStr == "home_assistant") {
        newService.type = TYPE_HOME_ASSISTANT;
      } else if (typeStr == "jellyfin") {
        newService.type = TYPE_JELLYFIN;
      } else if (typeStr == "http_get") {
        newService.type = TYPE_HTTP_GET;
      } else if (typeStr == "ping") {
        newService.type = TYPE_PING;
      } else {
        request->send(400, "application/json", "{\"error\":\"Invalid service type\"}");
        return;
      }

      newService.host = doc["host"].as<String>();
      newService.port = doc["port"] | 80;
      newService.path = doc["path"] | "/";
      newService.expectedResponse = doc["expectedResponse"] | "*";
      newService.checkInterval = doc["checkInterval"] | 60;

      int passThreshold = doc["passThreshold"] | 1;
      if (passThreshold < 1) passThreshold = 1;
      newService.passThreshold = passThreshold;

