bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  int httpCode = http.POST(payload);

  if (httpCode > 0) {
    Serial.printf("Discord notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send Discord notification: %d\n", httpCode);
  }

  http.end();
}

void sendMeshCoreNotification(const String& title, const String& message) {
  // ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Initialize BLE (on-demand, since we deinit after each use)
  initBLE();
  
  // Try to connect and send message
  if (meshDeviceConnected && meshTxCharacteristic != nullptr) {
    if (ensureMeshChannel()) {
      // Build the message: combine title and message
      String fullMessage = title + ": " + message;
      
      // CMD_SEND_CHANNEL_TXT_MSG payload:
      // txt_type (1 byte) - 0 for plain text
      // channel_index (1 byte)
      // timestamp (4 bytes, little-endian, unix seconds)
      // text (variable, UTF-8)
      
      size_t textLen = fullMessage.length();
      if (textLen > MAX_TEXT_MESSAGE_LEN) textLen = MAX_TEXT_MESSAGE_LEN;
      
      // CMD_SEND_CHANNEL_TXT_MSG: cmd(1) + txt_type(1) + channel_index(1) + timestamp(4) + text
      const size_t TIMESTAMP_SIZE = 4;
      size_t cmdLen = 1 + 1 + 1 + TIMESTAMP_SIZE + textLen;
      uint8_t* sendCmd = new uint8_t[cmdLen];
      
      sendCmd[0] = CMD_SEND_CHANNEL_TXT_MSG;
      sendCmd[1] = 0;  // txt_type = TXT_TYPE_PLAIN
      sendCmd[2] = meshChannelIndex;
      
      // Timestamp - use 0 to indicate "now" to the device, which will use its own clock
      // The MeshCore device typically has a more accurate time source
      // When timestamp is 0, the device substitutes its current time
      uint32_t timestamp = 0;
      sendCmd[3] = timestamp & 0xFF;
      sendCmd[4] = (timestamp >> 8) & 0xFF;
      sendCmd[5] = (timestamp >> 16) & 0xFF;
      sendCmd[6] = (timestamp >> 24) & 0xFF;
      
      // Copy message text
      memcpy(sendCmd + 7, fullMessage.c_str(), textLen);
      
      if (sendMeshFrame(sendCmd, cmdLen)) {
        // Wait for send confirmation
        if (waitForMeshResponse(5000)) {
          if (meshLastResponseCode == RESP_CODE_OK || meshLastResponseCode == RESP_CODE_SENT) {
            Serial.println("MeshCore notification sent successfully");
          } else {
            Serial.printf("MeshCore notification: unexpected response 0x%02X\n", meshLastResponseCode);
          }
        } else {
          Serial.println("MeshCore notification: no response (may still be sent)");
        }
      } else {
        Serial.println("MeshCore notification failed: write error");
      }
      
      delete[] sendCmd;
    } else {
      Serial.println("MeshCore notification skipped: channel not ready");
    }
  } else {
    Serial.println("MeshCore notification skipped: not connected");
  }
  
  // Disconnect BLE and deinitialize to free resources
  disconnectFromMeshCore();
  
  // Reconnect WiFi
  reconnectWiFi();
  
  // Resume monitoring
  bleOperationInProgress = false;
  monitoringPaused = false;
  
  Serial.println("MeshCore notification operation complete");
}

String base64Encode(const String& input) {
  size_t outputLength = 0;
  size_t bufferLength = ((input.length() + 2) / 3) * 4 + 4;
  unsigned char* output = new unsigned char[bufferLength];

  int result = mbedtls_base64_encode(
    output,
    bufferLength,
    &outputLength,
    reinterpret_cast<const unsigned char*>(input.c_str()),
    input.length()
  );

  String encoded = "";
  if (result == 0) {
    encoded = String(reinterpret_cast<char*>(output), outputLength);
  }

  delete[] output;
  return encoded;
}

bool readSmtpResponse(WiFiClient& client, int expectedCode) {
  unsigned long timeout = millis() + 5000;
  String line;
  int code = -1;

  do {
    while (!client.available() && millis() < timeout) {
      delay(10);
    }

    if (!client.available()) {
      Serial.println("SMTP response timeout");
      return false;
    }

    line = client.readStringUntil('\n');
    line.trim();
    if (line.length() >= 3) {
      code = line.substring(0, 3).toInt();
    }
  } while (line.length() >= 4 && line.charAt(3) == '-');

  if (code != expectedCode) {
    Serial.printf("SMTP unexpected response (expected %d): %s\n", expectedCode, line.c_str());
    return false;
  }

  return true;
}

bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode) {
  client.println(command);
  return readSmtpResponse(client, expectedCode);
}

void sendSmtpNotification(const String& title, const String& message) {
  WiFiClient plainClient;
  WiFiClientSecure secureClient;
  WiFiClient* client = &plainClient;

  if (SMTP_USE_TLS) {
    secureClient.setInsecure();
    client = &secureClient;
  }

  if (!client->connect(SMTP_SERVER, SMTP_PORT)) {
    Serial.println("Failed to connect to SMTP server");
    return;
  }

  if (!readSmtpResponse(*client, 220)) return;
  if (!sendSmtpCommand(*client, "EHLO esp32-monitor", 250)) return;

  if (strlen(SMTP_USERNAME) > 0) {
    if (!sendSmtpCommand(*client, "AUTH LOGIN", 334)) return;
    if (!sendSmtpCommand(*client, base64Encode(SMTP_USERNAME), 334)) return;
    if (!sendSmtpCommand(*client, base64Encode(SMTP_PASSWORD), 235)) return;
  }

  if (!sendSmtpCommand(*client, "MAIL FROM:<" + String(SMTP_FROM_ADDRESS) + ">", 250)) return;

  String recipients = String(SMTP_TO_ADDRESS);
  recipients.replace(" ", "");
  int start = 0;
  while (start < recipients.length()) {
    int commaIndex = recipients.indexOf(',', start);
    if (commaIndex == -1) commaIndex = recipients.length();
    String address = recipients.substring(start, commaIndex);
    if (address.length() > 0) {
      if (!sendSmtpCommand(*client, "RCPT TO:<" + address + ">", 250)) return;
    }
    start = commaIndex + 1;
  }

  if (!sendSmtpCommand(*client, "DATA", 354)) return;

